let pinyin = require('./functions')

this.alphabet = [];


var NAMES = ["国家开发银行", "中国工商银行", "中国农业银行", "中国银行", "中国建设银行", "中国邮政储蓄银行", "交通银行", "招商银行", "上海浦东发展银行", "兴业银行", "华夏银行", "广东发展银行", "中国民生银行", "中信银行", "中国光大银行", "恒丰银行", "浙商银行", "渤海银行", "平安银行", "上海农村商业银行", "玉溪市商业银行", "尧都农商行", "北京银行", "上海银行", "江苏银行", "杭州银行", "南京银行", "宁波银行", "徽商银行", "长沙银行", "成都银行", "重庆银行", "大连银行", "南昌银行", "福建海峡银行", "汉口银行", "温州银行", "青岛银行", "台州银行", "嘉兴银行", "常熟农村商业银行", "南海农村信用联社", "常州农村信用联社", "内蒙古银行", "绍兴银行", "顺德农商银行", "吴江农商银行", "齐商银行", "贵阳市商业银行", "遵义市商业银行", "湖州市商业银行", "龙江银行", "晋城银行JCBANK", "浙江泰隆商业银行", "广东省农村信用社联合社", "东莞农村商业银行", "浙江民泰商业银行", "广州银行", "辽阳市商业银行", "江苏省农村信用联合社", "廊坊银行", "浙江稠州商业银行", "德阳商业银行", "晋中市商业银行", "苏州银行", "桂林银行", "乌鲁木齐市商业银行", "成都农商银行", "张家港农村商业银行", "东莞银行", "莱商银行", "北京农村商业银行", "天津农商银行", "上饶银行", "富滇银行", "重庆农村商业银行", "鞍山银行", "宁夏银行", "河北银行", "华融湘江银行", "自贡市商业银行", "云南省农村信用社", "吉林银行", "东营市商业银行", "昆仑银行", "鄂尔多斯银行", "邢台银行", "晋商银行", "天津银行", "营口银行", "吉林农信", "山东农信", "西安银行", "河北省农村信用社", "宁夏黄河农村商业银行", "贵州省农村信用社", "阜新银行", "湖北银行黄石分行", "浙江省农村信用社联合社", "新乡银行", "湖北银行宜昌分行", "乐山市商业银行", "江苏太仓农村商业银行", "驻马店银行", "赣州银行", "无锡农村商业银行", "广西北部湾银行", "广州农商银行", "江苏江阴农村商业银行", "平顶山银行", "泰安市商业银行", "南充市商业银行", "重庆三峡银行", "中山小榄村镇银行", "邯郸银行", "库尔勒市商业银行", "锦州银行", "齐鲁银行", "青海银行", "阳泉银行", "盛京银行", "抚顺银行", "郑州银行", "深圳农村商业银行", "潍坊银行", "九江银行", "江西省农村信用", "河南省农村信用", "甘肃省农村信用", "四川省农村信用", "广西省农村信用", "陕西信合", "武汉农村商业银行", "宜宾市商业银行", "昆山农村商业银行", "石嘴山银行", "衡水银行", "信阳银行", "鄞州银行", "张家口市商业银行", "许昌银行", "济宁银行", "开封市商业银行", "威海市商业银行", "湖北银行", "承德银行", "丹东银行", "金华银行", "朝阳银行", "临商银行", "包商银行", "兰州银行", "周口银行", "德州银行", "三门峡银行", "安阳银行", "安徽省农村信用社", "湖北省农村信用社", "湖南省农村信用社", "广东南粤银行", "洛阳银行", "农信银清算中心", "城市商业银行资金清算中心"];

'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.split('').forEach(initial => {
   let cells = NAMES.filter(name => pinyin.getCamelChars(name[0]) === initial);
   this.alphabet.push({ initial, cells });
});

this.alphabet2 = [];
for (let [index, ele] of this.alphabet.entries()) {
    if (ele.cells.length) {
        let cells = ele.cells;
        let initial = ele.initial;
        this.alphabet2.push({ initial, cells });
    }
}

console.log(this.alphabet2);


// [{initial:'A',cells:['阿拉善盟','鞍山市','安庆市','安阳市','阿坝藏族羌族自治州','安顺市','阿里地区','安康市','阿克苏地区','阿勒泰地区','阿拉尔市','澳门特别行政区']},{initial:'B',cells:['北京市','保定市','包头市','巴彦淖尔市','本溪市','白山市','白城市','蚌埠市','亳州市','滨州市','佛山市','北海市','百色市','巴中市','毕节地区','保山市','宝鸡市','白银市','博尔塔拉蒙古自治州','巴音郭楞蒙古自治州']},{initial:'C',cells:['承德市','沧州市','赤峰市','朝阳市','常州市','滁州市','巢湖市','池州市','常德市','郴州市','潮州市','崇左市','成都市','楚雄彝族自治州','昌都地区','昌吉回族自治州']},{initial:'D',cells:['大同市','大连市','丹东市','大庆市','大兴安岭地区','东营市','德州市','东莞市','德阳市','达州市','大理白族自治州','德宏傣族景颇族自治州','迪庆藏族自治州','定西市']},{initial:'E',cells:['鄂尔多斯市','鄂州市','恩施土家族苗族自治州']},{initial:'F',cells:['抚顺市','阜新市','阜阳市','福州市','抚州市','防城港市']},{initial:'G',cells:['赣州市','广州市','桂林市','贵港市','广元市','广安市','甘孜藏族自治州','贵阳市','甘南藏族自治州','果洛藏族自治州','固原市']},{initial:'H',cells:['邯郸市','衡水市','呼和浩特市','呼伦贝尔市','葫芦岛市','哈尔滨市','鹤岗市','黑河市','淮安市','杭州市','湖州市','合肥市','淮南市','淮北市','黄山市','荷泽市','鹤壁市','黄石市','黄冈市','衡阳市','怀化市','惠州市','河源市','贺州市','河池市','海口市','红河哈尼族彝族自治州','汉中市','海东地区','海北藏族自治州','黄南藏族自治州','海南藏族自治州','海西蒙古族藏族自治州','哈密地区','和田地区']},{initial:'J',cells:['晋城市','晋中市','锦州市','吉林市','鸡西市','佳木斯市','嘉兴市','金华市','景德镇市','九江市','吉安市','济南市','济宁市','焦作市','荆门市','荆州市','江门市','揭阳市','嘉峪关市','金昌市','酒泉市']},{initial:'K',cells:['开封市','昆明市','克拉玛依市','克孜勒苏柯尔克孜自治州','喀什地区']},{initial:'L',cells:['廊坊市','临汾市','吕梁市','辽阳市','辽源市','连云港市','丽水市','六安市','龙岩市','莱芜市','临沂市','聊城市','洛阳市','漯河市','娄底市','柳州市','来宾市','泸州市','乐山市','凉山彝族自治州','六盘水市','丽江市','临沧市','拉萨市','林芝地区','兰州市','陇南市','临夏回族自治州']},{initial:'M',cells:['牡丹江市','马鞍山市','茂名市','梅州市','绵阳市','眉山市']},{initial:'N',cells:['南京市','南通市','宁波市','南平市','宁德市','南昌市','南阳市','南宁市','内江市','南充市','怒江傈僳族自治州','那曲地区']},{initial:'P',cells:['盘锦市','莆田市','萍乡市','平顶山市','濮阳市','攀枝花市','平凉市']},{initial:'Q',cells:['秦皇岛市','齐齐哈尔市','七台河市','衢州市','泉州市','青岛市','清远市','钦州市','黔西南布依族苗族自治州','黔东南苗族侗族自治州','黔南布依族苗族自治州','曲靖市','庆阳市','潜江市']},{initial:'R',cells:['日照市','日喀则地区']},{initial:'S',cells:['石家庄市','朔州市','沈阳市','四平市','松原市','双鸭山市','绥化市','上海市','苏州市','绍兴市','厦门市','三明市','上饶市','三门峡市','商丘市','十堰市','随州市','神农架','邵阳市','韶关市','深圳市','汕头市','汕尾市','三亚市','遂宁市','思茅市','山南地区','商洛市','石嘴山市','石河子市']},{initial:'T',cells:['天津市','唐山市','太原市','通辽市','铁岭市','通化市','泰州市','台州市','铜陵市','泰安市','铜仁地区','铜川市','天水市','吐鲁番地区','塔城地区','图木舒克市','台湾省','天门市']},{initial:'W',cells:['乌海市','乌兰察布市','无锡市','温州市','芜湖市','潍坊市','威海市','武汉市','梧州市','文山壮族苗族自治州','渭南市','武威市','吴忠市','乌鲁木齐市','五家渠市']},{initial:'X',cells:['邢台市','忻州市','兴安盟','锡林郭勒盟','徐州市','宿迁市','宿州市','宣城市','新余市','新乡市','许昌市','信阳市','襄樊市','孝感市','咸宁市','湘潭市','湘西土家族苗族自治州','西双版纳傣族自治州','西安市','咸阳市','西宁市','香港特别行政区','仙桃市']},{initial:'Y',cells:['阳泉市','运城市','营口市','延边朝鲜族自治州','伊春市','盐城市','扬州市','鹰潭市','宜春市','烟台市','宜昌市','岳阳市','益阳市','永州市','阳江市','云浮市','玉林市','宜宾市','雅安市','玉溪市','延安市','榆林市','玉树藏族自治州','银川市','伊犁哈萨克自治州']},{initial:'Z',cells:['张家口市','长治市','长春市','镇江市','舟山市','漳州市','淄博市','枣庄市','郑州市','周口市','驻马店市','长沙市','株洲市','张家界市','珠海市','湛江市','肇庆市','中山市','重庆市','自贡市','资阳市','遵义市','昭通市','张掖市','中卫市']}]
